In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\afham\appdata\local\programs\python\python313\lib\site-packages (2.3.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\afham\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\afham\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\afham\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\afham\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\afham\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

In [2]:
data =[["afham",40,80,50,60,70],
       ["ali",40,80,50,None,70],
       ["ahmed",40,80,50,60,70]]
df = pd.DataFrame(data,columns=["Name","science","math","english","urdu","chemistry"],index=["std1","std2","std3"])

In [3]:
df

       Name  science  math  english  urdu  chemistry
std1  afham       40    80       50  60.0         70
std2    ali       40    80       50   NaN         70
std3  ahmed       40    80       50  60.0         70

In [32]:
df.loc["std2"]

Name         ali
science       40
math          80
english       50
urdu
chemistry     70
Name: std2, dtype: object

In [33]:
df.iloc[0]

Name         afham
science         40
math            80
english         50
urdu            60
chemistry       70
Name: std1, dtype: object

In [28]:
df.drop('math',axis=1, inplace=True)

In [37]:
df.dtypes

Name          object
science        int64
math           int64
english        int64
urdu         float64
chemistry      int64
dtype: object

In [39]:
df.dropna(axis=1)

       Name  science  math  english  chemistry
std1  afham       40    80       50         70
std2    ali       40    80       50         70
std3  ahmed       40    80       50         70

In [40]:
df.describe()

       science  math  english  urdu  chemistry
count      3.0   3.0      3.0   2.0        3.0
mean      40.0  80.0     50.0  60.0       70.0
std        0.0   0.0      0.0   0.0        0.0
min       40.0  80.0     50.0  60.0       70.0
25%       40.0  80.0     50.0  60.0       70.0
50%       40.0  80.0     50.0  60.0       70.0
75%       40.0  80.0     50.0  60.0       70.0
max       40.0  80.0     50.0  60.0       70.0

In [41]:
df.describe().urdu

count     2.0
mean     60.0
std       0.0
min      60.0
25%      60.0
50%      60.0
75%      60.0
max      60.0
Name: urdu, dtype: float64

In [21]:
df['science']+df['math']

std1    120
std2    120
std3    120
dtype: int64

In [22]:
df.science + df.urdu

std1    100
std2    100
std3    100
dtype: int64

In [25]:
gg=pd.Series([2,6,8,9,6,5,3],index=["1","2","3",'4','5','6','7'])

In [26]:
gg.pop("4")

np.int64(9)

In [43]:
dataset = pd.read_csv("invest.csv")

In [45]:
dataset

   Year Profit Percentage  Additional Investment  Total Amount
0     1               25%                      0       6250.00
1     2              -30%                      0       4375.00
2     3               22%                      0       5337.50
3     4               28%                      0       6832.00
4     5               25%                   2000      10840.00
5     6                5%                      0      11382.00
6     7              -25%                      0       8536.50
7     8               30%                      0      11097.45
8     9              -22%                      0       8656.01
9    10               28%                      0      11079.69

In [46]:
dataset.head()

   Year Profit Percentage  Additional Investment  Total Amount
0     1               25%                      0        6250.0
1     2              -30%                      0        4375.0
2     3               22%                      0        5337.5
3     4               28%                      0        6832.0
4     5               25%                   2000       10840.0

In [44]:
dataset.dtypes

Year                       int64
Profit Percentage         object
Additional Investment      int64
Total Amount             float64
dtype: object

In [2]:
student = [{"name":"afham","fname":"zareef","finalmarks":80,"grade":"A+"},
           {"name":"afham","fname":"zareef","finalmarks":80,"grade":"A+"},
           {"name":"afham","fname":"zareef","finalmarks":80,"grade":"A+"}]
df = pd.DataFrame(student)

In [ ]:
pd.to_numeric(std_df[""],error="cor")

In [3]:
pd[pd.grade != 'A+']

AttributeError: module 'pandas' has no attribute 'grade'

In [2]:
student_d=pd.read_csv("data of five classes.csv")

In [3]:
student_d

           roll_no           name  exam1  exam2  final_exam
0    SMIT/DSAI/001    David Iqbal     20     16          35
1    SMIT/DSAI/002    Ahmed Ahmed     13      7          40
2    SMIT/DSAI/003     John Zahid     13     24          47
3    SMIT/DSAI/004    David Brown      0     15          24
4    SMIT/DSAI/005    Fatima Khan     20      8           6
..             ...            ...    ...    ...         ...
495   SMIT/MAW/096     Sara Zahid      8     10          45
496   SMIT/MAW/097     Ayesha Ali     14      3          31
497   SMIT/MAW/098  Michael Brown      2     20          50
498   SMIT/MAW/099     Sara Malik     24      6          16
499   SMIT/MAW/100       Noor Ali      9     11          44

[500 rows x 5 columns]

In [4]:
student_d["obtain_marks"] = student_d.iloc[:,2:].sum(axis = 1)

In [5]:
student_d["total_marks"] = 100

In [6]:
student_d

,roll_no,name,exam1,exam2,final_exam,obtain_marks,total_marks
0,SMIT/DSAI/001,David Iqbal,20,16,35,71,100
1,SMIT/DSAI/002,Ahmed Ahmed,13,7,40,60,100
2,SMIT/DSAI/003,John Zahid,13,24,47,84,100
3,SMIT/DSAI/004,David Brown,0,15,24,39,100
4,SMIT/DSAI/005,Fatima Khan,20,8,6,34,100
...,...,...,...,...,...,...,...
495,SMIT/MAW/096,Sara Zahid,8,10,45,63,100
496,SMIT/MAW/097,Ayesha Ali,14,3,31,48,100
497,SMIT/MAW/098,Michael Brown,2,20,50,72,100
498,SMIT/MAW/099,Sara Malik,24,6,16,46,100
499,SMIT/MAW/100,Noor Ali,9,11,44,64,100

In [7]:
student_d["percentage"] = (student_d.obtain_marks/student_d.total_marks)*100

In [8]:
student_d

,roll_no,name,exam1,exam2,final_exam,obtain_marks,total_marks,percentage
0,SMIT/DSAI/001,David Iqbal,20,16,35,71,100,71.0
1,SMIT/DSAI/002,Ahmed Ahmed,13,7,40,60,100,60.0
2,SMIT/DSAI/003,John Zahid,13,24,47,84,100,84.0
3,SMIT/DSAI/004,David Brown,0,15,24,39,100,39.0
4,SMIT/DSAI/005,Fatima Khan,20,8,6,34,100,34.0
...,...,...,...,...,...,...,...,...
495,SMIT/MAW/096,Sara Zahid,8,10,45,63,100,63.0
496,SMIT/MAW/097,Ayesha Ali,14,3,31,48,100,48.0
497,SMIT/MAW/098,Michael Brown,2,20,50,72,100,72.0
498,SMIT/MAW/099,Sara Malik,24,6,16,46,100,46.0
499,SMIT/MAW/100,Noor Ali,9,11,44,64,100,64.0

In [9]:
def grades(marks):
    if marks>80:
        return "A"
    elif marks>70:
        return "B"
    elif marks>50:
        return "c"
    else:
        return "F"

In [10]:
student_d["grade"]=student_d.percentage.apply(grades)

In [11]:
student_d

,roll_no,name,exam1,exam2,final_exam,obtain_marks,total_marks,percentage,grade
0,SMIT/DSAI/001,David Iqbal,20,16,35,71,100,71.0,B
1,SMIT/DSAI/002,Ahmed Ahmed,13,7,40,60,100,60.0,c
2,SMIT/DSAI/003,John Zahid,13,24,47,84,100,84.0,A
3,SMIT/DSAI/004,David Brown,0,15,24,39,100,39.0,F
4,SMIT/DSAI/005,Fatima Khan,20,8,6,34,100,34.0,F
...,...,...,...,...,...,...,...,...,...
495,SMIT/MAW/096,Sara Zahid,8,10,45,63,100,63.0,c
496,SMIT/MAW/097,Ayesha Ali,14,3,31,48,100,48.0,F
497,SMIT/MAW/098,Michael Brown,2,20,50,72,100,72.0,B
498,SMIT/MAW/099,Sara Malik,24,6,16,46,100,46.0,F
499,SMIT/MAW/100,Noor Ali,9,11,44,64,100,64.0,c

In [12]:
student_d.grade.value_counts()

grade
F    264
c    164
B     54
A     18
Name: count, dtype: int64

In [13]:
student_d["class"]=student_d['roll_no'].str.split('/').str[1]

In [14]:
student_d

,roll_no,name,exam1,exam2,final_exam,obtain_marks,total_marks,percentage,grade,class
0,SMIT/DSAI/001,David Iqbal,20,16,35,71,100,71.0,B,DSAI
1,SMIT/DSAI/002,Ahmed Ahmed,13,7,40,60,100,60.0,c,DSAI
2,SMIT/DSAI/003,John Zahid,13,24,47,84,100,84.0,A,DSAI
3,SMIT/DSAI/004,David Brown,0,15,24,39,100,39.0,F,DSAI
4,SMIT/DSAI/005,Fatima Khan,20,8,6,34,100,34.0,F,DSAI
...,...,...,...,...,...,...,...,...,...,...
495,SMIT/MAW/096,Sara Zahid,8,10,45,63,100,63.0,c,MAW
496,SMIT/MAW/097,Ayesha Ali,14,3,31,48,100,48.0,F,MAW
497,SMIT/MAW/098,Michael Brown,2,20,50,72,100,72.0,B,MAW
498,SMIT/MAW/099,Sara Malik,24,6,16,46,100,46.0,F,MAW
499,SMIT/MAW/100,Noor Ali,9,11,44,64,100,64.0,c,MAW

In [15]:
student_d['class'].unique()

array(['DSAI', 'DM', 'UIUX', 'GD', 'MAW'], dtype=object)

In [82]:
class1=student_d[student_d['class'] == 'DSAI']
class2=student_d[student_d['class'] == 'MAW']
class3 =student_d[student_d['class'] == "DM"]
class4 =student_d[student_d['class'] == "UIUK"]
class5 =student_d[student_d['class'] == "GD"]

In [93]:
print("....Class..1..")
print(f"{clas1['exam1'].mean()}")
print(clas1['final_exam'].mean())
print(clas1['percentage'].mean())
print(class1.grade.value_counts())

....Class..1..
13.35
24.08
49.89
grade
F    50
c    38
B     8
A     4
Name: count, dtype: int64

In [92]:
print("....Class..2..")
print(f"{class2['exam1'].mean()}")
print(class2['final_exam'].mean())
print(class2['percentage'].mean())
print(class2.grade.value_counts())

....Class..2..
12.08
23.01
48.65
grade
F    60
c    29
B     9
A     2
Name: count, dtype: int64

In [16]:
grouped = student_d.groupby('class')

In [17]:
grouped.get_group('DM')

,roll_no,name,exam1,exam2,final_exam,obtain_marks,total_marks,percentage,grade,class
100,SMIT/DM/001,Noor Hussain,15,8,34,57,100,57.0,c,DM
101,SMIT/DM/002,Fatima Ahmed,17,14,2,33,100,33.0,F,DM
102,SMIT/DM/003,David Johnson,16,4,41,61,100,61.0,c,DM
103,SMIT/DM/004,Michael Khan,21,18,21,60,100,60.0,c,DM
104,SMIT/DM/005,Noor Malik,22,23,33,78,100,78.0,B,DM
...,...,...,...,...,...,...,...,...,...,...
195,SMIT/DM/096,Ayesha Brown,9,17,21,47,100,47.0,F,DM
196,SMIT/DM/097,Ayesha Iqbal,10,3,11,24,100,24.0,F,DM
197,SMIT/DM/098,Ayesha Ahmed,12,17,45,74,100,74.0,B,DM
198,SMIT/DM/099,Hina Hussain,17,19,41,77,100,77.0,B,DM
199,SMIT/DM/100,Fatima Ali,22,16,34,72,100,72.0,B,DM

In [26]:
for cl in student_d['class'].unique():
    print(cl)
    cl_groups = grouped.get_group(cl)
    print(cl_groups['grade'].value_counts())
    print("average percentage:",cl_groups['percentage'].mean())
    print("-"*30)
    first_po_index = cl_groups['percentage'].argmax()
    second_po_index = cl_groups['percentage'].argsort().iloc[-2]
    third_po_index = cl_groups['percentage'].argsort().iloc[-2]
    print("First position:\n",cl_groups.iloc[first_po_index])
    print("-"*30)
    print("Second position:\n",cl_groups.iloc[second_po_index])
    print("-"*30)
    print("thirt position:\n",cl_groups.iloc[third_po_index])
    print("-"*30)

DSAI
grade
F    50
c    38
B     8
A     4
Name: count, dtype: int64
average percentage: 49.89
------------------------------
First position:
 roll_no         SMIT/DSAI/074
name              Ahmed Smith
exam1                      24
exam2                      15
final_exam                 48
obtain_marks               87
total_marks               100
percentage               87.0
grade                       A
class                    DSAI
Name: 73, dtype: object
------------------------------
Second position:
 roll_no         SMIT/DSAI/003
name               John Zahid
exam1                      13
exam2                      24
final_exam                 47
obtain_marks               84
total_marks               100
percentage               84.0
grade                       A
class                    DSAI
Name: 2, dtype: object
------------------------------
thirt position:
 roll_no         SMIT/DSAI/003
name               John Zahid
exam1                      13
exam2                      24
final_exam                 47
obtain_marks               84
total_marks               100
percentage               84.0
grade                       A
class                    DSAI
Name: 2, dtype: object
------------------------------
DM
grade
F    46
c    36
B    13
A     5
Name: count, dtype: int64
average percentage: 51.86
------------------------------
First position:
 roll_no         SMIT/DM/009
name             Sara Iqbal
exam1                    19
exam2                    17
final_exam               49
obtain_marks             85
total_marks             100
percentage             85.0
grade                     A
class                    DM
Name: 108, dtype: object
------------------------------
Second position:
 roll_no         SMIT/DM/085
name            David Malik
exam1                    10
exam2                    25
final_exam               50
obtain_marks             85
total_marks             100
percentage             85.0
grade                     A
class                    DM
Name: 184, dtype: object
------------------------------
thirt position:
 roll_no         SMIT/DM/085
name            David Malik
exam1                    10
exam2                    25
final_exam               50
obtain_marks             85
total_marks             100
percentage             85.0
grade                     A
class                    DM
Name: 184, dtype: object
------------------------------
UIUX
grade
F    58
c    28
B    10
A     4
Name: count, dtype: int64
average percentage: 48.97
------------------------------
First position:
 roll_no         SMIT/UIUX/033
name             Ayesha Smith
exam1                      21
exam2                      22
final_exam                 49
obtain_marks               92
total_marks               100
percentage               92.0
grade                       A
class                    UIUX
Name: 232, dtype: object
------------------------------
Second position:
 roll_no         SMIT/UIUX/092
name              Ahmed Zahid
exam1                      22
exam2                      24
final_exam                 44
obtain_marks               90
total_marks               100
percentage               90.0
grade                       A
class                    UIUX
Name: 291, dtype: object
------------------------------
thirt position:
 roll_no         SMIT/UIUX/092
name              Ahmed Zahid
exam1                      22
exam2                      24
final_exam                 44
obtain_marks               90
total_marks               100
percentage               90.0
grade                       A
class                    UIUX
Name: 291, dtype: object
------------------------------
GD
grade
F    50
c    33
B    14
A     3
Name: count, dtype: int64
average percentage: 50.17
------------------------------
First position:
 roll_no          SMIT/GD/092
name            Fatima Iqbal
exam1                     20
exam2                     24
final_exam                49
obtain_marks              93
total_marks              100
percentage              93.0
grade                      A
class                     GD
Name: 391, dtype: object
------------------------------
Second position:
 roll_no         SMIT/GD/073
name               Hina Ali
exam1                    21
exam2                    23
final_exam               47
obtain_marks             91
total_marks             100
percentage             91.0
grade                     A
class                    GD
Name: 372, dtype: object
------------------------------
thirt position:
 roll_no         SMIT/GD/073
name               Hina Ali
exam1                    21
exam2                    23
final_exam               47
obtain_marks             91
total_marks             100
percentage             91.0
grade                     A
class                    GD
Name: 372, dtype: object
------------------------------
MAW
grade
F    60
c    29
B     9
A     2
Name: count, dtype: int64
average percentage: 48.65
------------------------------
First position:
 roll_no         SMIT/MAW/006
name            Sara Johnson
exam1                     24
exam2                     22
final_exam                47
obtain_marks              93
total_marks              100
percentage              93.0
grade                      A
class                    MAW
Name: 405, dtype: object
------------------------------
Second position:
 roll_no         SMIT/MAW/092
name              John Smith
exam1                     20
exam2                     23
final_exam                41
obtain_marks              84
total_marks              100
percentage              84.0
grade                      A
class                    MAW
Name: 491, dtype: object
------------------------------
thirt position:
 roll_no         SMIT/MAW/092
name              John Smith
exam1                     20
exam2                     23
final_exam                41
obtain_marks              84
total_marks              100
percentage              84.0
grade                      A
class                    MAW
Name: 491, dtype: object
------------------------------

In [51]:
print(grouped.get_group('DM')['percentage'].mean())
print(grouped.get_group('DM')['grade'].value_counts())

51.86
grade
F    46
c    36
B    13
A     5
Name: count, dtype: int64

In [34]:
grouped.get_group('DSAI')

,roll_no,name,exam1,exam2,final_exam,obtain_marks,total_marks,percentage,grade,class
0,SMIT/DSAI/001,David Iqbal,20,16,35,71,100,71.0,B,DSAI
1,SMIT/DSAI/002,Ahmed Ahmed,13,7,40,60,100,60.0,c,DSAI
2,SMIT/DSAI/003,John Zahid,13,24,47,84,100,84.0,A,DSAI
3,SMIT/DSAI/004,David Brown,0,15,24,39,100,39.0,F,DSAI
4,SMIT/DSAI/005,Fatima Khan,20,8,6,34,100,34.0,F,DSAI
...,...,...,...,...,...,...,...,...,...,...
95,SMIT/DSAI/096,John Malik,4,18,50,72,100,72.0,B,DSAI
96,SMIT/DSAI/097,Ahmed Smith,7,14,9,30,100,30.0,F,DSAI
97,SMIT/DSAI/098,Ahmed Ali,9,13,33,55,100,55.0,c,DSAI
98,SMIT/DSAI/099,Ahmed Khan,24,4,39,67,100,67.0,c,DSAI
99,SMIT/DSAI/100,Noor Zahid,22,14,22,58,100,58.0,c,DSAI

In [20]:
grouped.get_group('GD')

,roll_no,name,exam1,exam2,final_exam,obtain_marks,total_marks,percentage,grade,class
300,SMIT/GD/001,Ali Johnson,12,22,15,49,100,49.0,F,GD
301,SMIT/GD/002,Noor Johnson,14,6,13,33,100,33.0,F,GD
302,SMIT/GD/003,John Johnson,9,13,15,37,100,37.0,F,GD
303,SMIT/GD/004,Ayesha Malik,23,25,27,75,100,75.0,B,GD
304,SMIT/GD/005,Hina Smith,19,8,11,38,100,38.0,F,GD
...,...,...,...,...,...,...,...,...,...,...
395,SMIT/GD/096,John Smith,13,22,5,40,100,40.0,F,GD
396,SMIT/GD/097,Sara Khan,23,18,1,42,100,42.0,F,GD
397,SMIT/GD/098,David Malik,13,3,26,42,100,42.0,F,GD
398,SMIT/GD/099,Ahmed Iqbal,2,25,25,52,100,52.0,c,GD
399,SMIT/GD/100,Michael Zahid,6,7,15,28,100,28.0,F,GD

In [21]:
grouped.get_group('UIUX')

,roll_no,name,exam1,exam2,final_exam,obtain_marks,total_marks,percentage,grade,class
200,SMIT/UIUX/001,Fatima Brown,22,16,42,80,100,80.0,B,UIUX
201,SMIT/UIUX/002,Fatima Hussain,20,11,34,65,100,65.0,c,UIUX
202,SMIT/UIUX/003,Michael Hussain,16,11,7,34,100,34.0,F,UIUX
203,SMIT/UIUX/004,John Ahmed,21,14,48,83,100,83.0,A,UIUX
204,SMIT/UIUX/005,Ali Johnson,13,13,20,46,100,46.0,F,UIUX
...,...,...,...,...,...,...,...,...,...,...
295,SMIT/UIUX/096,Ahmed Hussain,19,12,34,65,100,65.0,c,UIUX
296,SMIT/UIUX/097,John Khan,11,5,28,44,100,44.0,F,UIUX
297,SMIT/UIUX/098,John Brown,22,19,15,56,100,56.0,c,UIUX
298,SMIT/UIUX/099,Sara Ali,15,4,26,45,100,45.0,F,UIUX
299,SMIT/UIUX/100,Fatima Johnson,22,8,2,32,100,32.0,F,UIUX

In [24]:
grouped.get_group('MAW')

,roll_no,name,exam1,exam2,final_exam,obtain_marks,total_marks,percentage,grade,class
400,SMIT/MAW/001,Ahmed Ali,6,2,12,20,100,20.0,F,MAW
401,SMIT/MAW/002,Ali Zahid,12,0,7,19,100,19.0,F,MAW
402,SMIT/MAW/003,John Smith,7,21,15,43,100,43.0,F,MAW
403,SMIT/MAW/004,Ahmed Malik,7,16,24,47,100,47.0,F,MAW
404,SMIT/MAW/005,Michael Johnson,5,11,14,30,100,30.0,F,MAW
...,...,...,...,...,...,...,...,...,...,...
495,SMIT/MAW/096,Sara Zahid,8,10,45,63,100,63.0,c,MAW
496,SMIT/MAW/097,Ayesha Ali,14,3,31,48,100,48.0,F,MAW
497,SMIT/MAW/098,Michael Brown,2,20,50,72,100,72.0,B,MAW
498,SMIT/MAW/099,Sara Malik,24,6,16,46,100,46.0,F,MAW
499,SMIT/MAW/100,Noor Ali,9,11,44,64,100,64.0,c,MAW

In [7]:
df.loc['std3']

Name         ahmed
science         40
math            80
english         50
urdu          60.0
chemistry       70
Name: std3, dtype: object

In [8]:
df.iloc[2]

Name         ahmed
science         40
math            80
english         50
urdu          60.0
chemistry       70
Name: std3, dtype: object

In [13]:
df.drop('math',axis=1)

       Name  science  english  urdu  chemistry
std1  afham       40       50  60.0         70
std2    ali       40       50   NaN         70
std3  ahmed       40       50  60.0         70

In [19]:
df.describe().english

count     3.0
mean     50.0
std       0.0
min      50.0
25%      50.0
50%      50.0
75%      50.0
max      50.0
Name: english, dtype: float64

In [23]:
df.dtypes

Name          object
science        int64
math           int64
english        int64
urdu         float64
chemistry      int64
dtype: object

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, std1 to std3
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       3 non-null      object
 1   science    3 non-null      int64
 2   math       3 non-null      int64
 3   english    3 non-null      int64
 4   urdu       2 non-null      float64
 5   chemistry  3 non-null      int64
dtypes: float64(1), int64(4), object(1)
memory usage: 276.0+ bytes